{
"status": "ok",
"totalResults": 70,
"articles": [
  {
    "Title": "IoT-powered system for environmental conditions monitoring in poultry house: A case of Tanzania",
    "Abstract": "Poultry health is imperative for the continued growth of poultry and increased production. Environmental conditions such as temperature, humidity, and ammonia gas have an impact on poultry health. They affect the respiratory system and eventually cause death. In Tanzania, most smallholder farmers use charcoal and kerosene stoves to control the environmental parameters since they have limited access to low-cost, secure, and user-friendly poultry house monitoring systems. However, these traditional methods are unreliable, difficult to manage, not environmentally friendly, and inaccurate. Data were collected from 120 poultry farmers in Arusha and Kilimanjaro regions using convenience and snowball sampling techniques. Of the respondents, 43% revealed that smallholder farmers do not adopt automated systems despite being available because they are expensive. In this study, a system based on the Internet of Things (IoT) was developed for environmental conditions monitoring in poultry houses for low-resourced smallholder farmers in Tanzania. The system saves time (84%) and labour costs (66.7%) compared to the traditional system, as the farmer can monitor and control the conditions securely, reliably, and remotely. The study also proposes an algorithm for the system to work online and offline (i.e.,, synchronizing with the cloud server when internet access is available)",
    "Category": "IoT"
  },
 
  {
    "Title": "Agricultural robotics research applicable to poultry production: A review",
    "Abstract": "The advent of agricultural robotics research worldwide has brought substantial improvement for various applications. This article provides a comprehensive review of published research and development work, emphasizing robotics enabling machine capabilities. These machine capabilities of perception, reasoning and learning, communication, task planning and execution, and systems integration have opened possibilities for intelligent automation of current and future agricultural operations, including precision livestock farming. We have focused on the Agricultural Intelligent Automation Systems which have a high potential to be applied to agricultural production and processing, especially with applicability to poultry production. Most of the published work on agricultural robotics has been in the areas of perception and reasoning. The emphases have been in the identification of objects, evaluation of product quality, monitoring of plant and animal growth and development, yield prediction, and machine guidance. There has been limited published work on the task execution and systems integration aspects of agricultural robotics. Moreover, we have reviewed agricultural robotics research from 24 universities worldwide. Agricultural robots can be divided into three categories (monitor, harvester, and both) according to various functions. Several tables are presented to summarize the information on the key subject areas reviewed in this article. We have found that there are still many challenges that need to be addressed in robotizing agricultural tasks in general and in poultry production specifically. The most common challenges in robotics applications have been developing robots for specific agricultural tasks. Examples in poultry production include monitoring environmental conditions and chicken health, egg picking, and encouraging chicken movement. The approaches to addressing the technical needs have been creating intelligent movable machines for use alongside the chickens in poultry house. The most noticeable results include Octopus Poultry Safe (OPS) robot for sanitizing poultry houses autonomously, PoultryBot for picking floor eggs, and Spoutnic for training hens to move. This trend of research and development is expected to continue. An emerging research emphasis is systems approach to study the interactions of automated tasks to achieve high efficiency in whole poultry house management.",
    "Category": "IoT"
  },
 
  {
    "Title": "Thermal stress and high stocking densities in poultry farms: Potential\n effects and mitigation strategies",
    "Abstract": "Environmental changes pose significant threats to agricultural activities particularly animal production. These changes have induced major concerns which will negatively affect the poultry health and productivity under the current climate changes. Moreover, they also alter the immunological status of the exposed birds and make them susceptible to different diseases. The adverse effects of environmental stress also include poor performance of birds (reduced feed intake, growth, feed efficiency, immunity, and egg production) and inferior product quality. The adverse effect of heat stress on different quail breeds like Japanese quail, bobwhite quail, scaled quail, and Gambel's quail ranged from decreased growth rates (11.0–14.5%), body weight (7.7–13.2%), feed intake (6.1–21.6%), feed efficiency (4.3–8.6%), and egg production (6.6–23.3%). Also, birds reared under heat stress (34 °C) had significantly decreased Haugh units by 10.8% and egg weight by 14.3% in comparison with the control group (reared at 22 °C). On the other hand, increasing stoking density from 30 to 45 kg/m2 also negatively affected the feed intake and body weight. Recent studies have focused on evaluating the potential adverse effects of different environmental stresses on poultry performance, behavior, welfare, and reproduction. It is imperative to understand better the interaction of different environmental factors and their subsequent effects on avian physiology, to spotlights on the effective management and nutritional strategies to alleviate the adverse effects of different stresses in poultry. This review aims to present a comprehensive overview of physiological manifestations of major environmental stresses including thermal stress (heat and cold stress) and high stocking densities on poultry health and production. Moreover, we have also critically evaluated the scope and efficacy of some potential strategies to mitigate the influences of these environmental stressors in different poultry species.",
    "Category": "IoT"
  },
 
  {
    "Title": "Visual Guidance and Egg Collection Scheme for a Smart Poultry Robot for Free-Range Farms",
    "Abstract": "Free-range chicken farming allows egg-laying hens to move freely through their environment and perform their natural behavior, including laying her eggs. However, it takes time to gather these eggs manually, giving rise to high labor costs. This study proposes a smart mobile robot for poultry farms that can recognize eggs of two different colors on free-range farms. The robot can also pick up and sort eggs without damaging them. An egg feature extraction method with automatic thresholding is employed to detect both white and brown eggs, and a behavior-based navigation method is applied to allow the robot to reach the eggs while avoiding obstacles. The robot can move towards the position of each egg via visual tracking. Once the egg is within the collection area of the robot, it is gathered, sorted and stored in the tank inside the robot. Experiments are carried out in an outdoor field of size 5 m × 5 m under different climatic conditions, and the results showed that the average egg recognition rate is between 94.7% and 97.6%. The proposed mobile poultry robot is low in production cost and simple in operation. It can provide chicken farmers with automatic egg gathering on free-range farms.",
    "Category": "IoT"
  },
  {
    "Title": "Separate weighing of male and female broiler breeders by electronic platform weigher using camera technologies",
    "Abstract": "The body weight of breeding broiler chickens (broiler breeders) is an important control variable used to optimize the amount, quality and fertility of the eggs being laid. In modern breeding barns, the population of animals generally supports a female:male ratio of 10:1, wherein males and females each receive their own food supply. To control this supply the broiler breeders are weighed using automatic electronic platform weighers and the weights are then classified into cockerel and hen categories using theoretical growth curves. However, due to the non-uniform growth of the animals and replacement (called spiking) of cockerals this classification is not always correct, causing a risk of under/over feeding of the population. To overcome this challenge, in this study we have developed a system that integrates the electronic platform weigher with the low-cost 3D Kinect camera was employed to separate weigh male and female broiler breeders under commercial conditions. A novel image processing algorithm is proposed. The algorithm first constructed the Height Accumulating Image (HAI) using depth image to locate the region of interest (ROI) where a broiler breeder jumps onto the weigher, then the comb size was calculated on RGB image as the gender classifying feature, and finally, an adaptive classification threshold was determined by the kernel density estimation using the recent days comb size measurements. The results showed that enough measurements can be obtained for estimating overall weight expectation with the average acceptance rate of 77.32%. Based on these accepted measurements, the accuracy, sensitivity, precision, and specificity were 99.7%, 98.82%, 100% and 100% respectively.",
    "Category": "IoT"
  },
  
  {
    "Title": "An Adaptive Vision Navigation Algorithm in Agricultural IoT System for Smart Agricultural Robots",
    "Abstract": "As the agricultural internet of things (IoT) technology has evolved, smart agricultural robots needs to have both flexibility and adaptability when moving in complex field environments. In this paper, we propose the concept of a vision-based navigation system for the agricultural IoT and a binocular vision navigation algorithm for smart agricultural robots, which can fuse the edge contour and the height information of rows of crop in images to extract the navigation parameters. First, the speeded-up robust feature (SURF) extracting and matching algorithm is used to obtain featuring point pairs from the green crop row images observed by the binocular parallel vision system. Then the confidence density image is constructed by integrating the enhanced elevation image and the corresponding binarized crop row image, where the edge contour and the height information of crop row are fused to extract the navigation parameters (θ, d) based on the model of a smart agricultural robot. Finally, the five navigation network instruction sets are designed based on the navigation angle θ and the lateral distance d, which represent the basic movements for a certain type of smart agricultural robot working in a field. Simulated experimental results in the laboratory show that the algorithm proposed in this study is effective with small turning errors and low standard deviations, and can provide a valuable reference for the further practical application of binocular vision navigation systems in smart agricultural robots in the agricultural IoT system.",
    "Category": "IoT"
  },
  
  {
    "Title": "Smart poultry management: Smart sensors, big data, and the internet of things",
    "Abstract": "As the world’s population increases, demand for poultry products will continue to increase. To meet this demand, one candidate mechanism to increase production is to increase housing and manage more birds. However, this practice, along with labour shortages and increasing biosecurity practices will make it increasingly difficult for producers to monitor the production, health, and welfare status of all their birds. Employing smart poultry management systems is necessary to increase production while minimizing costs and the use of resources. Smart poultry management systems include precision livestock farming (PLF) technologies such as smart sensors, automation of farm processes, and data driven decision making platforms. Many new technologies will have great implications for poultry production in the areas of the poultry house environment, bird welfare, precision feeding, and rapid detection of infectious disease. As smart sensors collect data in real-time on a variety of parameters from poultry operations, large amounts of data will be generated. To make best use of this data, big data analytical tools must be employed to produce data driven decisions. Additionally, the devices that will be incorporated into smart poultry management systems will be connected to the Internet allowing for the formation of Internet of things (IoT) farm networks. IoT technologies allow for communication between farm sensors, devices, and equipment, and will lead to the automation of multiple farm procedures. The following review discusses the areas of impact that new smart sensor technologies will have on poultry operations and describes how sensor technology is related to big data analytics and IoT systems, and how these technologies can enhance production in the poultry industry. Additionally, challenges to the described systems and technologies will also be highlighted and discussed.",
    "Category": "IoT"
  },
  {
    "Title": "Environmental monitoring in a poultry farm using an instrument developed with the internet of things concept",
    "Abstract": "Animal welfare is a major concern these days, as well as the factors that have impact on animal productivity. Constant monitoring of environmental parameters such as temperature, humidity, levels of ammonia and luminosity is crucial because these variables directly impact poultry performance and welfare. Along these lines, it is necessary to look for solutions that allow the monitoring of these variables in a practical, reliable and cheap way. In the agribusiness, the scenario for the IoT (Internet of Things) is very promising, because it has emerged to fill this gap and deliver sensed data, widely increasing the connectivity of the devices. Therefore, this paper describes a low cost, hardware and software proposal for monitoring these environmental parameters in poultry farms. In addition, experiments were done to compare the proposed prototype with commercial devices. The measured variables showed a correlation above 0.90 between the sensors used in the prototype and the calibrated equipment, also having the cost of only 13% of that of the conventional equipment. The prototype displayed favorable results, indicating that its implementation is viable.",
    "Category": "IoT"
  },
  {
    "Title": "IoT Based Poultry House Monitoring",
    "Abstract": "Recently, the use of IoT (Internet of Things) based system has been expanded with inestimable Internet resources. The system demonstrates the creation of innovative systems that facilitate control and supervision regardless of distance and time. In a poultry house, both temperature and humidity levels should be monitored regularly in ensuring the system runs smoothly. It needs to be monitored 24/7 to avoid incidents that caused the temperature rises too high. This paper highlights the IoT solution in monitoring the temperature and humidity condition including the presence of electricity connectivity, regardless of time and place.",
    "Category": "IoT"
  },
  {
    "Title": "Data fusion method of livestock and poultry breeding internet of things based on improved support function",
    "Abstract": "Currently, IoT (Internet of Things) technology has been widely applied in livestock breeding. For the characteristics of perception data collected from livestock breeding IoT (such as multi-source, heterogeneous, real-time, and so on), we propose a livestock breeding IoT data fusion model. Firstly, it's easy to produce abnormal data in livestock breeding IoT due to the harsh work environment, transmission network noise and other factors. In order to guarantee the accuracy of livestock breeding IoT data, we check the consistency of original data collected by livestock breeding IoT sensors through the regression prediction method based on sliding window. We determine the sliding window size, then estimate the sensor measurement value at a certain moment through the regression forecast method and calculate the prediction interval, next determine whether the actual measurement value is abnormal compared with prediction interval, and finally replace abnormal data with predictive value. Secondly, there is the problem of uneven distribution of environmental monitoring values in breeding room. In order to comprehensively analyze and evaluate the breeding environment and provide accurate basis for automatic control equipment, we propose a homogeneous data weighted fusion algorithm which fuses homogeneous data that are collected from the same type of sensors based on support function. The support function has been proposed to describe a certain support degree or proximity between 2 numbers, and used to calculate the weights of a set of data. The weighted algorithm in this paper improves support functions so as to improve the accuracy of data fusion. We calculate the support degree of a set of pig breeding environment perception data to get corresponding optimal weights through the improved support function and then the weighted fusion for the same type of livestock breeding IoT sensor set data. Finally, in view of the characteristics different with livestock breeding multi-source perception data storage format and sensor devices encoding, the encoding rules format and data organization for livestock breeding IoT are formulated, which can uniformly describe heterogeneous data in the process of livestock and poultry breeding. Such a standard can be converted into a standard data format, which can work as the basis of data analysis and data applications. Areal production data from pig breeding IoT in Tianjin Huikang breeding pig farm show that in the data consistency test phase, the abnormal sensory data detection rate is 96.67%, which ensures the accuracy of the data, and in homogeneous data fusion phase, the improved support function in this paper has the minimum fusion variance of 0.192 5 compared with other 2 kinds of support functions in the multi-source data fusion calculation, which improves the accuracy of homogeneous data fusion and provides the accurate and reasonable basis for the automatic control of equipment. And coding standard of livestock IoT environment factors and sensor equipment makes unified expression to the sensors, which are from different manufacturers and environmental data with varied representations. Livestock breeding IoT data fusion model proposed in this paper can effectively improve the accuracy of data fusion, and meet the requirements of livestock breeding IoT data analysis.",
    "Category": "IoT"
  },
  {
    "Title": "A Review of Groundbreaking Changes in the Poultry Industry in Bangladesh Using the Internet of Things (IoT) and Computer Vision Technology",
    "Abstract": "As the number of people increases daily, the requirement for animal meat is also growing in the country. Therefore, the use of technology in the poultry industry is essential to meet all these needs adequately. IoT & Computer Vision Technology is playing a crucial role in the transformation of the poultry industry. IoT & Computer Vision Technology is advancing so much day by day that it will turn the poultry industry into a groundbreaking poultry industry. The primary function of a poultry farm is to produce meat and eggs. At present, the cost of meat and egg production in our country needs to be further reduced. Proper maintenance of poultry boilers increases meat and egg production. Still, poultry farmers in our country do not have a clear idea about smart poultry farms, so they cannot use innovative technology properly, but developed countries use smart technology. In addition to making more profit at a lower cost, they can meet the demand for animal meat of the people in their country. This paper’s main objective is to monitor poultry farms using IoT and computer vision technology and be aware of the poultry farm environment, which will help in transforming the poultry industry into a groundbreaking poultry industry.",
    "Category": "IoT"
  },
  {
    "Title": "Diffusion model simulation of odor pollutants in livestock and poultry farms based on environmental monitoring of the Internet of Things",
    "Abstract": "Livestock pollution is one of the main sources of agricultural pollution, which has a negative\nimpact on the global environment. Monitoring, simulation and early warning of major pollutants emitted\nfrom livestock production is of great significance for reducing agricultural pollution. Especially, real-time\ncomprehensive monitoring and early warning of the concentration and distribution of harmful gases could\nimprove the harm of livestock production to people, livestock itself and the environment, and increase the\nsafety level of livestock production. This study focused on the perception and monitoring of the discharge\nstatus of livestock farming simulation technics, mainly to carry out Internet of Things-based monitoring of\nthe main components of livestock culture pollutants, and to use odor gas air dispersion software “ModOdor”\nto simulate the spread of pollutants. This study was aimed to determine the characteristics of pollutant\ndiffusion in typical farms, which could provide decision reference to odor hygienic buffer zone and\nminimum shelter distance to achieve the ecological and safety objectives of livestock farming.",
    "Category": "IoT"
  },
  {
    "Title": "IoT based Smart Management of Poultry Farm and Electricity Generation",
    "Abstract": "Poultry is one of the most important growing economic segments of agricultural sector in India today. Nowadays because of standardized farming management and good manufacturing practices, chicken production in the world has been increasing gradually. In contemporary world automation plays a vital role and concept of Internet of Things (IOT) is also emerging very fast, there is an approach to convert traditional systems into automated systems. The paper focuses on automation of poultry farm using IoT technology to perform various management related things. The environmental factors which affect the health of chicken such as temperature, humidity, light and Ammonia gas are monitored and the manual jobs like food feeding, water supply system, cleanliness are managed. If all these parameters are maintained, the production and quality of chicken increases. Along with this, electricity is generated from the methane gas which is produced from the chicken manure and stored in battery. The management and monitoring of the farm can also be done through a web based system. Which keeps track of the management of poultry farm from anywhere and at any time.",
    "Category": "IoT"
  },
  {
    "Title": "Automated Poultry Farm with Microcontroller based Parameter Monitoring System and Conveyor Mechanism",
    "Abstract": "Poultry Farming is a potential developing segment in Indian animal husbandry business. Imbibing automation into traditional poultry farming methods provides the advantages of improving productivity, quality, and safety while avoiding wastage. Many farms face labour shortage and pollution issues due to the accumulation of manure. There is a practical difficulty in manually cleaning the manure for reducing pollution. Egg collection, as well as manure disposal, are the areas that are considered to be automated which is discussed in this paper. Bringing in automation to these areas can save a lot of time and labour cost. This will also improve the cleanliness inside the farm thereby reducing illness among the fowl. A combination of software and hardware systems can be used to make the labour-intensive jobs inside the farm into automated processes. The efficiency of the farm can be increased by keeping the farm environment in optimal conditions required for the growth of chickens. This paper proposes a model that monitors the environmental parameters such as temperature, level of ammonia, humidity etc. inside poultry farms and controls it by several methods to maintain an optimal environment. Natural incubation produces a smaller number of chicks due to variation in humidity and temperature. A solar-powered mechanized incubator system is also designed with egg turning mechanism and environmental parameter controls. The system thus focuses on increasing farm productivity with minimal human effort and to reduce pollution.",
    "Category": "IoT"
  },
  {
    "Title": "A witted Management of Poultry Farm using IoT",
    "Abstract": "Poultry is one of the most important growing economic segments of agricultural sector in India today. Nowadays because of standardized farming management and good manufacturing practices, chicken production in the world has been increasing gradually. In contemporary world automation plays a vital role and concept of Internet of Things (IoT) is also emerging very fast, the re is an approach to convert traditional systems into automated systems. The project focuses on automation of poultry farm using IoT technology to perform various management related things. The environmental factors which affect the health of chicken such as temperature, humidity, light and Ammonia gas are monitored and the manual jobs like food feeding, water supply system, cleanliness are managed. Monitoring of chicks as per cycle is done hence giving an alert to the owner. Weight of the chicken is measured for quality production. If all these parameters are maintained, the production and quality of chicken increases0.",
    "Category": "IoT"
  },
  {
    "Title": "Smart Chicken Farm Monitoring System",
    "Abstract": "Recently, the using of smart technology are common working process in various  field such as agriculture, traffic light and medical. In the process of poultry farming in the world, rapid development of technology has been built such as closed poultry farming equipped with technological systems and more to smart farming system due to the high demand for chicken broiler all over the world including Malaysia. As a consequence, many new poultry farmers have ventured into this field. However, many of them suffer from problems such as chicken diseases due to the unconducive environment of chicken coop. Unsuitable temperature and humidity in chicken coop may lead the chicken susceptible to disease such as Coryza which causes chicken eyes become swollen and loss appetite. Therefore, a system named Smart Chicken Farm Monitoring System has been developed to monitor and control the environment of chicken coop by using sensors and Internet of Thing (IoT) platform. With this system, poultry farmers can monitor and control the temperature and humidity in the coop using DHT11 automatically. Poultry farmers can also estimate the weight of chickens by using the load cell sensor to identify the maturity of chicken broilers in the coop. This system is believed may help chicken farmers in monitoring a conducive chicken coop and the growth of the chicken broiler.",
    "Category": "IoT"
  },
  
  {
    "Title": "A Preliminary Study on Poultry Farm Environmental Monitoring using Internet of Things and Blockchain Technology",
    "Abstract": "This paper presents the application of Internet of Things (IoT) and blockchain technology in poultry industry. Production of poultry is highly depending on the environment parameter like temperature, humidity, air and lighting to maintain and to boost the production of poultry. Monitoring all the environmental parameters is crucial for a large poultry farm, especially in traditional way. Recently, the adoption of IoT and Blockchain is used for monitoring and controlling the farm automatically. It is proven that it can reduce cost and the poultry farm well-managed. At first, the data of temperature are monitored using IoT-based temperature and humidity sensor and recorded in JSON format. From the results, the data is successfully transmitted to IOTA blockchain. Blockchain will ensure the data is secured and transparent to consumers.",
    "Category": "IoT"
  }
]
}
