{
"status": "ok",
"totalResults": 70,
"articles": [
  {
    "Title": "Monitoring and Detection of Heat Stress of Layers in Poultry Farm using Multiple Linear Regression",
    "Abstract": "Environmental change has a major impact on the performance of a poultry farm. Due to high temperature and high relative humidity, the humidex value will increase at an unprecedented rate. Later, this leads to heat stress in layer poultry farm. In such situation, the data is collected using an IoT device for which the Multiple Linear Regression algorithm is formulated to predict the heat stress level in the poultry farm. The accuracy of the model is determined using Root Mean Squared Error, R-Square and Adjusted R-Square methods. The results show that as the humidex value increases, heat stress in poultry farm increases by affecting the overall performance of the layers in a poultry farm",
    "Category": "ML"
  },
  
  {
    "Title": "PSO-LSSVM model for Hy-Line Brown laying-type hens ’egg-laying rate prediction based on PCA",
    "Abstract": "Statistical models for predicting potential laying pattern were important for economically optimal breeding strategy of egg production in a poultry flock. The aim of this study was to establish an optimal model for describing egg production using room temperature, feed consumption, layer weight, and age during the production period. The following mathematical models were used PSO-LSSVM (Particle swarm optimization-Least squares support vector machines) and PCA (Principal component analysis). The daily recorded of egg production data from 19,666 laying-type hens was used. Hen-daily egg production was described using egg-laying rate during successive days after reaching sexual maturity (120 days of age) and daily recorded room temperature, feed consumption, layer weight, and age. Then present study used PCA to study the correlation between this data. Using the Pearson correlation coefficient of the five factors (maximum and minimum shed temperatures, layer weight, feed consumption, and age) and egg-laying rate, the present study weighted each factor according to its influence on the egg-laying rate. In addition, LSSVM was used to create a regression model of the weighted data, and PSO was to optimize parameters (penalty coefficient c and kernel parameter g) in the LSSVM. Our experimental results showed that the goodness-of-fit criteria value (MSE) was small, lower than that of existing prediction models. The PSO-LSSVM model was able to fit well egg-laying rate of the whole Hy-Line Brown laying-type hens' flock",
    "Category": "ML"
  },
  {
    "Title": "Estimating and tuning adaptive action plans for the control of smart interconnected poultry houses",
    "Abstract": "The systematic choice, update, and implementation of periodic () action plans define the feed conversion rate () in poultry farming, an acceptable measure for successful production. Appropriate plans provide tailored resources, allowing broilers to grow within the so-called comfort zone, without waste or lack of resources. Although the implementation of an action plan is automatic, its configuration depends on a specialist, which result in variable . In this article, the specialist’s perception is reproduced, to some extent, by computational intelligence. By combining deep learning and genetic algorithms, we show how action plans can adapt their performance over the time, based on previous well succeeded plans. We also implement a network infrastructure to replicate our method over distributed poultry houses, for their smart and interconnected control. A supervision system is provided as interface to users. Experiments using real data suggest an improvement of 5% on the performance of the most productive specialist, staying close to the optimal .",
    "Category": "ML"
  },
  {
    "Title": "Comparison of neuro-fuzzy and neural networks techniques for estimating ammonia concentration in poultry farms",
    "Abstract": "Ammonia (NH3) is a primary air pollutant in poultry farms that affects the ecosystem, environment, and birds and humans' health adversely. Therefore, estimating NH3 concentration is valuable in research on environmental protection, human and animal health, litter management, etc. The study's main objective was to develop a simple, accurate, rapid, and economic model that estimates NH3 concentration in poultry farms best. To do so, four different models—multilayer perceptron (MLP), integrated adaptive neuro-fuzzy inference systems with grid partitioning and subtractive clustering (ANFIS-GP and ANFIS-SC), and multiple linear regression analysis (MLR)—were performed to estimate NH3 concentration in poultry farms using climatic variables and litter quality properties that can be obtained easily. The root mean square error (RMSE), mean relative percentage absolute error (MRPE), and determination coefficient (R2) were used to evaluate the applied models' performance. A comparison of the results indicated that the ANFIS-SC model, the inputs of which are air temperature, air relative humidity, and airspeed, was the most suitable estimation model with respect to RMSE, MRPE, and R2 to predict NH3 concentration (1.130 ppm, 4.032%, and 0.858, respectively) for the validation dataset. The MLR model's results were the least accurate. In conclusion, this study recommends the neurocomputing model developed as an alternative approach to estimating NH3 concentration in poultry farms because it yields accurate estimations quickly",
    "Category": "ML"
  },
  
  {
    "Title": "Prophesying egg production based on energy consumption using multi-layered adaptive neural fuzzy inference system approach (ANFIS)",
    "Abstract": "Adaptive neural fuzzy inference system (ANFIS) is an intelligent neuro-fuzzy technique used for modeling and control of uncertain systems. In this paper, we proposed an ANFIS based modeling approach (called MLANFIS) where the number of data pairs employed for training was adjusted by application of clustering method. By employing this method, the number of data required for learning step and thereby its complexity were significantly reduced. The results obtained were compared with those obtained by using artificial neural networks (ANNs). Inputs to the first group were feed supply, fuel and machinery and the ones to second cluster were pullet, electricity and labor energies. Finally, the outputs of aforementioned networks were considered as inputs to ANFIS 3 network and predicted values of egg yield were derived. The coefficient of determination (R²), root mean square error (RMSE) and mean absolute percentage error (MAPE) parameters of ANFIS 3 network were calculated as 0.92, 448.126, 0.014, respectively showing that ANFIS compared with ANNs with statistical parameters as 0.81, 751.96 and 0.019 respectively, can properly predict the egg yield of poultry farms. As a recommendation for future studies, ANFIS models with multi-layered structures can be developed to find the optimum number of layers.",
    "Category": "ML"
  },
  {
    "Title": "Fuzzy prediction and pattern analysis of poultry egg production",
    "Abstract": "Egg production is geared towards large scale production of eggs for profit maximization and consumption. But poultry farmers are faced with challenges that affect the quantity and quality of egg production during the production life cycle such as quality of feed intake, management issues, genetic factors of the breed birds, age at egg laying period, presence of diseases, molting flock, housing and others. Several mechanical solutions have been suggested to implement the production cycle but with very high cost implication which calls for the need of soft computing methods to model the egg production process. However, modelling egg production curve is a complex task because a typical egg production curve (from week 20 to week 72) is characterized by nonlinear probabilities and imprecise knowledge in the egg production process. This paper proposes an optimal fuzzy predictive model for poultry egg production. The motivation stems from analyzing the non-linearity and imprecision in egg production which is best handled by fuzzy logic as compared to other soft computing techniques. Data samples were collected on the age of chicks, quantity of feeds, quality of feeds, body weight of chicks and total egg production as input into the proposed system. The first stage of implementation is carried out in the Statistical Package for Social Science (SPSS) software environment to perform correlation analysis while the last two stages are carried out using Fuzzy Toolbox in MATLAB based on its capability to model and simulate complex systems with robust and interpretable predictions. Gaussian membership function was used in the fuzzification process while Mamdami structure was adopted as the fuzzy inference system (FIS). Model performance evaluation showed that the proposed system performed excellently by achieving best prediction accuracy 100% Pred(30) with an approximate mean magnitude relative error (MMRE) of 0.11744 as compared to the results in the reported literature. The method has proven to be a cost-effective and simple approach to modelling through the use of samples and parameters from poultry house.",
    "Category": "ML"
  },
  {
    "Title": "Energy and phosphorus evaluation of poultry meal fed to broiler chickens using\n a regression method",
    "Abstract": "Two experiments were conducted to determine energy (Exp. 1) and P (Exp. 2) utilization in poultry meal (PM) for broiler chickens. A total of 192 birds were allotted to 3 experimental diets in a randomized complete block design with BW as a blocking factor on d 15 and 16 post hatching in Exp. 1 and 2, respectively. Each diet was fed to 8 replicate cages with 8 birds per cage in both experiments. Initial BW of birds in Exp. 1 and 2 were 438 ± 76.9 g and 543 ± 50.2 g, respectively. Three corn-soybean meal-based diets were prepared to contain 0, 80, or 160 g/kg in Exp. 1 and 0, 50, or 100 g/kg in Exp. 2. In Exp. 1, the addition of PM to the reference diet linearly decreased (P < 0.01) the apparent ileal digestibility of DM and gross energy (GE), as well as the apparent total tract utilization (ATTU) of DM, GE, and N in diets; but did not affect the ileal digestible energy, ME, and MEn of diets. The ileal digestible energy, ME, and MEn of PM estimated by the regression method were 4,002, 3,756, and 3,430 kcal/kg DM, respectively, representing 58 to 68% of the GE in PM. In Exp. 2, graded concentration of PM in the reference diet linearly decreased (P < 0.05) ATTU of DM but linearly increased (P < 0.01) ATTU of P and quadratically increased ATTU of Ca in diets. The true ileal digestibility and true total tract utilization of P in PM estimated by the regression method were 77.5 and 79.0%, respectively. In conclusion, these results showed that inclusion of poultry meal in the diets of broiler chickens reduced the digestibility of GE but increased the utilization of P. The regression-estimated energy values and P digestibility of PM in the current studies may be used in diet formulation.",
    "Category": "ML"
  },
 
  {
    "Title": "Evaluating and predicting egg quality indicators through principal component analysis and artificial neural networks",
    "Abstract": "Egg quality is a multidimensional concept that depends on many different parameters. Many studies have evaluated different egg quality attributes subjected to various storage conditions. The present work aimed to study the influence of three environmental parameters (temperature, storage time and relative humidity) on egg quality indicators. Through application of response surface methodology, it was verified that the temperature is the most important environmental factor affecting egg quality attributes followed by the storage time and relative humidity, respectively. Principal Component Analysis showed that most quality indexes are similar except for the eggshell percentage that represents an exterior quality indicator. An artificial neural network composed by one hidden layer and four neurons provided accurate predictions of the Yolk index and is a promising tool to evaluate egg quality.",
    "Category": "ML"
  },
  {
    "Title": "Proposing a framework for sustainable feed formulation for laying hens: A systematic review of recent developments and future directions",
    "Abstract": "Feed production is a significant contributor to the environmental footprint of livestock products. Feed formulation may therefore provide valuable opportunities to reduce impacts and improve sustainability outcomes in livestock production. Goal programming (GP) is currently the leading multi-criteria decision analysis (MCDA) tool used in feed formulation, taking into account cost and nutritional considerations only. Environmental goals are not typically included. Life Cycle Assessment (LCA) is a commonly utilized tool used to evaluate the magnitude and distribution of environmental impacts along product supply chains. LCAs of feed inputs can produce information that enables discriminating among feed inputs based on the resource/environmental impacts characteristic of their production, processing, and transportation. The purpose of this review is to identify the necessary elements of a framework for the integration of regionalized life cycle impact assessment (LCIA) results for laying hen feed input supply chains into goal programming-based feed formulation. In this way, the sustainability of specific feed formulations can be evaluated and improved, subject to cost and nutritional constraints. Towards this end, published research addressing three sub-topics were reviewed: LCA of feed inputs, goal programming, and feed formulation. Integration of sustainability considerations into feed formulation must take four essential aspects into account, including: individual feed ingredients (as decision variables); total cost of ingredients; their associated, regionally specific life cycle environmental impacts (as objective functions); and the nutritional requirements of laying hens (as nutrient constraints). A framework for regionalized, life cycle-based sustainable feed formulation using weighted goal programming is proposed. Key improvement opportunities including integration of regionalized feed input supply chain models and impact assessment methods, and development of improved weighting methods to reconcile economic and environmental goals were identified and discussed.",
    "Category": "ML"
  },
  {
    "Title": "Feed Formula Optimization Based on Improved Tabu Search Algorithm",
    "Abstract": "The profitability of the livestock industry largely depends on cost-effective feed formula as feed accounts for a large proportion of production costs. Recently, it is one of research hotspots that investigation on how to scientifically formulate livestock feed reducing the cost. In this work, an Improved Tabu Search (ITS) algorithm is proposed to study the pig feed formula optimization method. The proposed ITS algorithm focuses on combination of the tabu search algorithm and intelligent optimization algorithms, which can obtain advantages of global and local optimization search from traditional optimization algorithms. The experimental results show that the ITS algorithm can achieve higher precision search and performs better than other optimization algorithms.",
    "Category": "ML"
  },
  {
    "Title": "A Mathematical Model for Optimizing Organic Feed Mix Problem",
    "Abstract": "In Thailand, demand for organic pork has emerged in recent years because of consumer concerns for health and the environment. Consequently, this creates a demand for organic feed for swine. This paper provides a linear programming model for an organic feed mix problem. The model considers a set of non-organic and organic raw materials (RMs) with their supply availabilities and organic RMs percentage in dry weight. An optimal feed formulation is determined to satisfy nutrient requirements and organic proportion of the feed, as well as to minimize their total RMs purchase and pre-processing costs. A numerical example is given to demonstrate the model use.",
    "Category": "ML"
  },
  {
    "Title": "Precision animal feed formulation: An evolutionary multi-objective approach",
    "Abstract": "Most livestock producers aim for optimal ways of feeding their animals. Conventional algorithms approach optimum feed formulation by minimizing feed costs while satisfying constraints related to nutritional requirements of the animal. The optimization process needs to be performed every time a nutritional requirement is changed due to the nonlinear relationship between the relaxation of the different nutritional requirements and the feed cost. Consequently, decision-making becomes a time-consuming trial and error process. In addition, the nonlinear relationship changes depending on the type of materials used, their nutritional compositions and costs as well as the animal’s nutritional requirements. Therefore, in this work, we formulated a multi-objective feed formulation problem comprising of two objects – a) minimizing feed cost and b) minimizing deviation from the specified requirements. The problem is solved using a population-based evolutionary multi-objective optimization algorithm (NSGA-II) that results in an optimal set of comprised solutions in a single run. The availability of the entire set of comprised solutions facilitates the understanding of the relationship between different nutritional requirements and cost, thus leading to a more efficient decision-making process. We demonstrated the applicability of the proposed method by performing experimental simulations on several cases of dairy and beef cattle feed formulation.",
    "Category": "ML"
  },
  {
    "Title": "Application of artificial neural network (ANN) for animal diet formulation modeling",
    "Abstract": "This paper focuses on training the mathematical models for prediction of optimal livestock feed blend for animal. In this paper, three functions are trained to find the most optimal percentage of price, nutrients and water. For this purpose three objective functions has been prepared using corresponding values of feed ingredients and an algorithm is developed using ANN. The objective functions are trained with 5000 random values to find the optimized results and prediction ability is compared with existing model. Developed algorithm shows superiority over the existing programming models.",
    "Category": "ML"
  },
  {
    "Title": "Study of real-coded hybrid genetic algorithm (RGA) to find least-cost ration for non-pregnant dairy buffaloes",
    "Abstract": "In Mandya District of Karnataka, the cost of milk per litre was more in case of buffaloes compared to local cows due to high fat content and high nutritive value of buffaloes’ milk than its counterpart. Based on earlier research, it was clear that the productivity of the buffaloes maintained by different dairy farms was lower. Therefore, there is a need to focus on two important aspects of dairy farming: one to increase the milk productivity of buffaloes and the other one to minimize the diet cost by upgrading the scientific dairy farming practices. Though several techniques are in use for animal diet formulation but a successful application of soft computing technique to improve the quality of the solution is always preferred as the rigidity of the functions in LPP can be easily handled. Therefore, to meet the nutrient requirements at lowest cost, we have developed a Hybrid real coded Genetic Algorithm (RGA) for formulating the least cost ration for dairy buffaloes. This technique is better than old conventional techniques, in the sense that it does not break if the inputs are modified and provides better results over complex problem even if it is linear programming model. The linear programming model is developed from primary data collected from NIANP and as per the standards of ICAR. Next, the developed algorithms; RGA and Hybrid RGA are executed and compared with other least cost feed formulation techniques in non-pregnant dairy buffalo weighing 450 kg and yielding 10 L milk with 6% of fat content as a model and considering standard nutrient requirement on dry matter basis. Further goal programming model (GP model) has been developed as there are two high priority objectives (out of eight goals) i.e. least cost and dry matter intake, to be achieved simultaneously, if possible. This GP model is also solved by hybrid RGA showing that four goals out of eight are fully achieved. It could be concluded that real coded genetic algorithm (RGA) with hybrid function can effectively be used to economize the total mixed ration cost such that the feed requirements of the animals are met without any nutrients deficiency.",
    "Category": "ML"
  },
  {
    "Title": "An improved algorithm for solving profit-maximizing cattle diet problems",
    "Abstract": "Feeding cattle with on-pasture supplementation or feedlot diets can increase animal efficiency and system profitability while minimizing environmental impacts. However, cattle system profit margins are relatively small and nutrient supply accounts for most of the costs. This paper introduces a nonlinear profit-maximizing diet formulation problem for beef cattle based on well-established predictive equations. Nonlinearity in predictive equations for nutrient requirements poses methodological challenges in the application of optimization techniques. In contrast to other widely used diet formulation methods, we develop a mathematical model that guarantees an exact solution for maximum profit diet formulations. Our method can efficiently solve an often-impractical nonlinear problem by solving a finite number of linear problems, that is, linear time complexity is achieved through parametric linear programming. Results show the impacts of choosing different objective functions (minimizing cost, maximizing profit and maximizing profit per daily weight gain) and how this may lead to different optimal solutions. In targeting improved ration formulation on feedlot systems, this paper demonstrates how profitability and nutritional constraints can be met as an important part of a sustainable intensification production strategy.",
    "Category": "ML"
  },
  {
    "Title": "Mobile applications to obtain minimum cost feed mixes",
    "Abstract": "In this study, ration preparation software to minimize the cost of feed for ruminant livestock such as cattle, sheep, and goats for both milk and meat yield was developed for Web- and Android-based systems using genetic algorithms. To maximize accessibility on PCs, smartphones, and tablet PCs, we used Web- and Android-based software to find cheaper feed mixes that satisfy the nutritional requirements of ruminants. With this novel system, farmers and scientists can obtain low-cost feed mixes via the Web or smartphones, regardless of time or location. This application is useful for feed producers and farmers because they can use this software from any location and at any time. Users can input their new feed resources for preparing rations",
    "Category": "ML"
  },
  {
    "Title": "Optimizing laying hen diet using particle swarm optimization with two swarms",
    "Abstract": "Formulating animal diet by accounting fluctuating cost, nutrient requirement, balanced amino acids, and maximum composition simultaneously is a difficult and complex task. Manual formulation and Linear Programming encounter difficulty to solve this problem. Furthermore, the complexity of laying hen diet problem is change through ingredient choices. Thus, an advanced technique to enhance formula quality is a vital necessity. This paper proposes the Multi-Swarm Particle Swarm Optimization (MSPSO) to enhance the diversity of particles and prevent premature convergence in PSO. MSPSO work cooperatively and competitively to optimize laying hen diet and produce improved and stable formula than Genetic Algorithm, Hybridization of Adaptive Genetic Algorithm and Simulated Annealing, and Standard Particle Swarm Optimization with less time complexity. In addition, swarm size, iteration, and inertia weight parameters are investigated and show that swarm size of 50 for each sub-swarm, total iteration of 16,000, and inertia weight of 6.0 should be used as a good parameter for MSPSO to optimize laying hen diet.",
    "Category": "ML"
  },
  {
    "Title": "Fodder composition optimization using modified genetic algorithm",
    "Abstract": "Determination of the fodder composition is a difficult process because it should simultaneously consider several constraints, such as minimizing the total cost of feed ingredients and maximizing the nutrient needs required by livestock. This study uses a modified genetic algorithm to solve the problem in order to obtain better results. The modification is done by applying numerical methods in generating an initial population of the genetic algorithm. Testing results show that the optimal parameters that can be used to produce the optimal solution are as follows: population size (popsize) is 300, generation number is 400, crossover rate (cr) value is 0.2, and mutation rate (mr) value is 0.6. The modified genetic algorithm provides an average fitness value of 0.142357, while the classical genetic algorithm provides an average fitness value of 0.094354. With a little additional computational time, which is equal to 110 ms, the use of modified genetic algorithm which is offered has proven to provide a better result, with a higher fitness value compared with classical genetic algorithm.",
    "Category": "ML"
  }
]
}
