[
  
  {
    "Title": "Design of Sick Chicken Automatic Detection System Based on Improved Residual Network",
    "Abstract": "In order to build an intelligent management platform for remote monitoring of livestock and poultry breeding environment based on the Internet of Things and big data, behavioral physiology and production performance tracking monitoring, this article uses broilers as an example to independently develop an automatic detection system for sick chickens based on ResNet residual network. ResNet residual network can alleviate the problem of disappearance of gradient descent and difficulty of network optimization as the number of network layers increases. This system is based on the traditional ResNet residual network. By improving the network structure of ResNet, an improved ResNet-FPN disease chicken recognition model is designed to adapt to different recognition environments. This article first discusses the pros and cons of the traditional artificial expert system diagnostic method, then expands the target picture size through data augmentation, and after tens of thousands of iterative training, finally the model recognition on the test set is improved by 2.1% and the prediction accuracy is improved. Experimental results show that the recognition rate of the model on the test set is as high as 93.7%. Compared with the traditional expert system for diagnosing poultry disease patterns, the model is more effective and robust. Compared with the traditional expert system for identifying sick chickens, this system improves the speed and accuracy of identification and saves a lot of manpower costs.",
    "Category": "DL"
  },
  
  {
    "Title": "A machine vision system to detect and count laying hens\n in battery cages",
    "Abstract": "Manually counting hens in battery cages on large commercial poultry farms is a challenging task: time-consuming and often inaccurate. Therefore, the aim of this study was to develop a machine vision system that automatically counts the number of hens in battery cages. Automatically counting hens can help a regulatory agency or inspecting officer to estimate the number of living birds in a cage and, thus animal density, to ensure that they conform to government regulations or quality certification requirements. The test hen house was 87 m long, containing 37 battery cages stacked in 6-story high rows on both sides of the structure. Each cage housed 18 to 30 hens, for a total of approximately 11 000 laying hens. A feeder moves along the cages. A camera was installed on an arm connected to the feeder, which was specifically developed for this purpose. A wide-angle lens was used in order to frame an entire cage in the field of view. Detection and tracking algorithms were designed to detect hens in cages; the recorded videos were first processed using a convolutional neural network (CNN) object detection algorithm called Faster R-CNN, with an input of multi-angular view shifted images. After the initial detection, the hens’ relative location along the feeder was tracked and saved using a tracking algorithm. Information was added with every additional frame, as the camera arm moved along the cages. The algorithm count was compared with that made by a human observer (the ‘gold standard’). A validation dataset of about 2000 images achieved 89.6% accuracy at cage level, with a mean absolute error of 2.5 hens per cage. These results indicate that the model developed in this study is practicable for obtaining fairly good estimates of the number of laying hens in battery cages.",
    "Category": "DL"
  },
  {
    "Title": "Detection of sick broilers by digital image processing and deep learning",
    "Abstract": "Frequently, the occurrence of poultry diseases can seriously threaten human health. Even though the quantity and density of poultry rearing are high, monitoring of poultry diseases is still based on manual observation. In this paper, a model structure was proposed to identify sick broilers within a flock by using digital image processing and deep learning. For this aim, a broiler dataset (B1) containing 14,728 images was built, and the PASCAL VOC2012 dataset containing 17,125 images was added as background images for training. The Improved Feature Fusion Single Shot MultiBox Detector (IFSSD) was proposed to improve the Single Shot MultiBox Detector (SSD) model, with InceptionV3 as the backbone. The structure of IFSSD changed the size and dimension of the four layers in the modified InceptionV3 by 1 × 1 convolution, pairwise fused the layers to obtain three different size layers, and then generated a feature pyramid network based on these three layers. IFSSD can detect broilers and identify the health status of the broilers simultaneously. The model achieves 99.7% mean average precision (mAP) (intersection-over-union (IoU) > 0.5) and 48.1% mAP (IoU > 0.9). It runs at 40 frames per second (fps) on a single NVIDIA 1070Ti GPU. Overall, the results indicate that sick broilers within a flock can be successfully detected automatically, and the method has the potential to facilitate efficient flock management.",
    "Category": "DL"
  },
 
  {
    "Title": "Nondestructive detection for egg freshness grade based on\n hyperspectral imaging technology",
    "Abstract": "In order to identify the freshness grade of eggs nondestructively and rapidly, hyperspectral imaging technology was used in this article. The hyperspectral data of 200 samples of three freshness grades was acquired by using hyperspectral image acquisition system (400.68–1,001.612 nm), and then the freshness grade of egg samples was measured by stoichiometry. First, Mahalanobis distance algorithm was used to remove abnormal sample data. Second, savitzky–golay and wavelet threshold denoising combined with standard normalized variable were used to pretreat the spectral data, respectively. Third, iteratively retains informative variables (IRIV), variable iterative space shrinkage approach, and competitive adaptive reweighted sampling were used for feature wavelength selection. Since the classification accuracy of support vector machine (SVM) model was affected by the selection of parameters, genetic algorithm (GA) was introduced to search the optimal parameters in SVM and compared with grid search algorithm. Finally, the result indicated that the classification accuracy of training set and test set of the optimal classification model (IRIV‐GA‐SVM) reached 99.29% and 97.87%, respectively. Thus, it is feasible to use hyperspectral image technology to detect egg freshness grade. Practical Applications The freshness grade is one of the most important indexes to measure the quality of eggs. Traditional methods of detecting egg freshness grade are time‐consuming and destructive, which cannot meet the test needs of modern agriculture. Hyperspectral imaging, an emerging technology, can provide both spectral and spatial information simultaneously, and has the advantages of nondestructive, fast and nonpollution. The result indicated that hyperspectral imaging technology for the detection of freshness grade of eggs is feasible.",
    "Category": "DL"
  },
  {
    "Title": "Cracked egg recognition based on machine vision",
    "Abstract": "Since the cracks on eggshell are difficult to be recognized due to the surrounding highlighted dark spots on the egg surface under back-light illumination, a new method to identify the cracks based on machine vision was proposed. After analyzing the characteristics of the cracks in the image of the egg under the back-light illumination, a negative LOG (Laplacian of Gaussian) operator was employed to effectively enhance the cracks in the egg image. Then the Hysteresis thresholding algorithm was adopted to acquire the proper thresholds, which eliminated the irrelevant dark spots in the binary egg image and ensured the continuity of the cracks. Finally, the improved LFI (Local Fitting Image) index was used to distinguish the crack region from the mislabeled region. The experimental results showed that the proposed method was effective in cases of complicated egg surface conditions, such as irregular dark spots and invisible micro-cracks, with cracked egg recognition rate of 92.5%.",
    "Category": "DL"
  },
  {
    "Title": "An automatic sorting system for unwashed eggs using deep learning",
    "Abstract": "Egg quality and safety are significant concerns of consumers and modern food industries. This study proposes a novel and precise assessment of egg sorting using a deep convolutional neural network (CNN), which is a state-of-the-art computer vision method to perform classification tasks. To classify unwashed egg images, VGG16 architecture was modified by a global average pooling layer, dense layers, a batch normalization layer, and a dropout layer. The modified model was trained based on intact, bloody, and broken (breakage, crack, or hole on the eggshell) eggs, which were combined with being dirty. Performance evaluation of the CNN model through 5-fold cross-validation showed that it outperforms traditional machine vision-based models. The accuracy, precision, sensitivity, specificity, and area under the curve were 96.55, 95.59, 94.92, 97.39, and 96.16%, respectively. The CNN model achieved an average overall accuracy of 94.84 by 5-fold cross-validation.",
    "Category": "DL"
  },
  {
    "Title": "Egg Crack Detection Based on Support Vector Machine",
    "Abstract": "with the development of agricultural intelligence, it is of great significance to detect egg quality by machine vision and support vector machine in the field of food safety. In order to solve the problems of low efficiency and low accuracy of existing detection methods for egg crack detection, this paper proposes an egg crack detection and recognition method based on support vector machine and machine vision. The feature parameters of egg crack image are extracted by gray scale conversion, median filtering, linear sharpening, threshold segmentation and other means, and the support vector machine model is established, and the model is used to identify and detect eggs. The experimental results show that the model can distinguish intact eggs from cracked eggs, and the detection accuracy of cracked eggs is 98.75%",
    "Category": "DL"
  },
  {
    "Title": "Internet of Things for the Future of Smart Agriculture: A Comprehensive Survey of Emerging Technologies",
    "Abstract": "This paper presents a comprehensive review of emerging technologies for the internet of things (IoT)-based smart agriculture. We begin by summarizing the existing surveys and describing emergent technologies for the agricultural IoT, such as unmanned aerial vehicles, wireless technologies, open-source IoT platforms, software defined networking (SDN), network function virtualization (NFV) technologies, cloud/fog computing, and middleware platforms. We also provide a classification of IoT applications for smart agriculture into seven categories: including smart monitoring, smart water management, agrochemicals applications, disease management, smart harvesting, supply chain management, and smart agricultural practices. Moreover, we provide a taxonomy and a side-by-side comparison of the state-ofthe-art methods toward supply chain management based on the blockchain technology for agricultural IoTs. Furthermore, we present real projects that use most of the aforementioned technologies, which demonstrate their great performance in the field of smart agriculture. Finally, we highlight open research challenges and discuss possible future research directions for agricultural IoTs",
    "Category": "IoT"
  },
  {
    "Title": "A Review on Computer Vision Technology for Monitoring Poultry Farm–Application, Hardware, and Software",
    "Abstract": "The productivity and profitability of poultry farming are crucial to support its affordability issues in food security. Criteria in productivity measurement, including Feed Conversion Ratio (FCR) calculation, whereas economic management is essential for profitability. Hence, best management practices need to be implemented throughout the growth period for optimizing the poultry performance. This review provides a comprehensive overview of computer vision technology for poultry industry research. This review relies on the use of several online databases to identify key works in the area of computer vision in a poultry farm. We recommend our search by focusing on four keywords, `computer vision' and `poultry' or `chicken' or `broiler' that had been published between 2010 and early 2020 with open access provided by University Teknologi Malaysia only. All the selected papers were manually examined and sorted to determine their relevance to computer vision in a poultry farm. We focus on the latest developments by focusing on the hardware and software parts used to analyze the poultry data with some examples of various representative studies on poultry farming. Notably, hardware parts can be classified into camera types, lighting units and camera position, whereas software parts can be categorized into data acquisition and analysis software types as well as data processing and analysis methods that can be implemented into the software types. This paper concludes by highlighting the future works and key challenges that needed to be addressed to assure the quality of this technology prior to the successful implementation of the poultry industry.",
    "Category": "DL"
  },
  
  {
    "Title": "Identifying Images of Dead Chickens with a Chicken Removal System Integrated with a Deep Learning Algorithm",
    "Abstract": "The chicken industry, in which broiler chickens are bred, is the largest poultry industry in Taiwan. In a traditional poultry house, breeders must usually observe the health of the broilers in person on the basis of their breeding experience at regular times every day. When a breeder finds unhealthy broilers, they are removed manually from the poultry house to prevent viruses from spreading in the poultry house. Therefore, in this study, we designed and constructed a novel small removal system for dead chickens for Taiwanese poultry houses. In the mechanical design, this system mainly contains walking, removal, and storage parts. It comprises robotic arms with a fixed end and sweep-in devices for sweeping dead chickens, a conveyor belt for transporting chickens, a storage cache for storing chickens, and a tracked vehicle. The designed system has dimensions of approximately 1.038 × 0.36 × 0.5 m3, and two dead chickens can be removed in a single operation. The walking speed of the chicken removal system is 3.3 cm/s. In order to enhance the automation and artificial intelligence in the poultry industry, the identification system was used in a novel small removal system. The conditions of the chickens in a poultry house can be monitored remotely by using a camera, and dead chickens can be identified through deep learning based on the YOLO v4 algorithm. The precision of the designed system reached 95.24% in this study, and dead chickens were successfully moved to the storage cache. Finally, the designed system can reduce the contact between humans and poultry to effectively improve the overall biological safety",
    "Category": "DL"
  },
  {
    "Title": "Development and Optimization of a Deep-learning-based Egg Collecting Robot",
    "Abstract": "Manual collection of floor eggs in cage-free hen housing systems is time-consuming and laborious. The objectives of this study were to (1) develop a robot to automatically collect floor eggs and (2) optimize the performance of recognizing and picking eggs with the robot. The robot consisted of a deep-learning-based egg detector, a robot arm, a two-finger gripper, and a hand-mounted camera. The deep-learning model, You Only Look Once (YOLO) V3, was embedded in the vision system to detect and locate eggs on a simulated litter floor in real-time. Image processing algorithms (e.g., cropping, erosion, etc.) were implemented for the detection and provided the robot with centroid coordinates, orientation, and axis lengths of the detected eggs, so that the gripper could be manipulated with an appropriate angle and opening width to grasp the detected eggs. For optimization, the YOLO V3 model was retrained with a dataset of floor eggs and achieved >93% performance in detecting and locating eggs. The kernel size of 65 x 65 pixels for erosion and dilation in image processing assisted in extracting the geometry features of eggs with the least remaining noises. Among the tested materials, soft grouting sponge attached to the gripper had the highest success rates for egg picking. The robot achieved 92% to 94% success in picking white and brown eggs. In sum, the developed egg-collecting robot can be relied on for picking floor eggs to assist in precision management of cage-free hen housing systems",
    "Category": "DL"
  },
 
  {
    "Title": "Weight and volume estimation of poultry and products based on computer vision systems: a review",
    "Abstract": "The appearance, size, and weight of poultry meat and eggs are essential for production economics and vital in the poultry sector. These external characteristics influence their market price and consumers' preference and choice. With technological developments, there is an increase in the application and importance of vision systems in the agricultural sector. Computer vision has become a promising tool in the real-time automation of poultry weighing and processing systems. Owing to its noninvasive and nonintrusive nature and its capacity to present a wide range of information, computer vision systems can be applied in the size, mass, volume determination, and sorting and grading of poultry products. This review article gives a detailed summary of the current advances in measuring poultry products' external characteristics based on computer vision systems. An overview of computer vision systems is discussed and summarized. A comprehensive presentation of the application of computer vision-based systems for assessing poultry meat and eggs was provided, that is, weight and volume estimation, sorting, and classification. Finally, the challenges and potential future trends in size, weight, and volume estimation of poultry products are reported.",
    "Category": "DL"
  },
  {
    "Title": "On-line weight estimation of broiler carcass and cuts by a computer vision system",
    "Abstract": "In a broiler carcass production conveyor system, inspection, monitoring, and grading carcass and cuts based on computer vision techniques are challenging due to cuts segmentation and ambient light conditions issues. This study presents a depth image-based broiler carcass weight prediction system. An Active Shape Model was developed to segment the carcass into four cuts (drumsticks, breasts, wings, and head and neck). Five regression models were developed based on the image features for each weight estimation (carcass and its cuts). The Bayesian-ANN model outperformed all other regression models at 0.9981 R2 and 0.9847 R2 in the whole carcass and head and neck weight estimation. The RBF-SVR model surpassed all the other drumstick, breast, and wings weight prediction models at 0.9129 R2, 0.9352 R2, and 0.9896 R2, respectively. This proposed technique can be applied as a non-destructive, non-intrusive, and accurate on-line broiler carcass production system in the automation of chicken carcass and cuts weight estimation.",
    "Category": "DL"
  },
  {
    "Title": "Automated Tracking Systems for the Assessment of Farmed Poultry",
    "Abstract": "The world's growing population is highly dependent on animal agriculture. Animal products provide nutrient-packed meals that help to sustain individuals of all ages in communities across the globe. As the human demand for animal proteins grows, the agricultural industry must continue to advance its efficiency and quality of production. One of the most commonly farmed livestock is poultry and their significance is felt on a global scale. Current poultry farming practices result in the premature death and rejection of billions of chickens on an annual basis before they are processed for meat. This loss of life is concerning regarding animal welfare, agricultural efficiency, and economic impacts. The best way to prevent these losses is through the individualistic and/or group level assessment of animal on a continuous basis. On large-scale farms, such attention to detail was generally considered to be inaccurate and inefficient, but with the integration of Artificial Intelligence (AI) assisted technology individualized and per-herd assessments of livestock are possible and accurate. Various studies have shown cameras linked with specialized systems of AI can properly analyze flocks for health concerns, thus improving the survival rate and product quality of farmed poultry. Building on the recent advancements, this review explores the aspects of AI in the detection, counting and tracking of the poultry in commercial and research-based applications.",
    "Category": "DL"
  },
  
  {
    "Title": "Implementation egg sorting system based on neural network image processing and artificial intelligence",
    "Abstract": "A sorting system is needed in various fields and is useful for classifying an object in terms of size, color or weight of an object, in large-scale industrial companies the sorting system is assisted by a sensor connected to an electronic device, the sensor is able to distinguish an object in terms of size color and shape, for example in the vehicle and automotive industries are useful in the process of sorting defective components or in the beverage packaging industry products to see and measure the number of measurements of the volume on the packaging, apart from large-scale industries the sorting system is also included in the agricultural sector and fisheries, one of which is used for the sorting process of poultry eggs, the eggs need to be sorted from color in order to differentiate between the eggs of poultry that will hatch or not and to equalize the number of egg sizes, the current technology used is still conventional, namely with the help of lighting and sorting manually using a conveyor machine with the checking process one by one. This technology still has some weaknesses, namely the sorting system will be missed because it still relies on direct vision, to overcome this a computer vision technology with a camera rock that is integrated into a main computer system, so that a measurable sorting system is needed a dataset, data that is using egg samples by dividing a dataset into traning data and testing data, the data will measure the accuracy of each object recorded using the neural-network algorithm process, this algorithm has high accuracy in the process of reading data by up to 90%, thereby reducing the error value when this sorting system is implemented",
    "Category": "DL"
  },
  {
    "Title": "Detection of Eggshell Defects using Convolutional Neural Networks",
    "Abstract": "In commercial egg farming industries, the automatic sorting of defective eggs is economically and healthily important. Nowadays, detect of defective eggs is performed manually. This situation involves time consuming, tiring and complex processes. For all these reasons, automatic classification of defects that may occur on the egg surface has become a very important issue. For this purpose, in this study, classification of egg defects was performed using AlexNet, VGG16, VGG19, SqueezeNet, GoogleNet, Inceptionv3, ResNet18, and Xception architectures, which were developed based on Convolutional Neural Networks (CNN), which provide high performance in object recognition and classification. To test the performance of these architectures, an original data set containing dirty, bloody, cracked, and intact eggs were built. As a result of experimental studies, the highest accuracy score was obtained with VGG19 architecture as 96.25%. In these results, it was observed that ESA methods achieved high success in classifying defective eggs.",
    "Category": "DL"
  },
  {
    "Title": "Identification and Classification of Poultry Eggs: A Case Study Utilizing Computer Vision and Machine Learning",
    "Abstract": "We developed a method to identify, count, and classify chickens and eggs inside nesting boxes of a chicken coop. Utilizing an IoT AWS Deep Lens Camera for data capture and inferences, we trained and deployed a custom single-shot multibox (SSD) object detection and classification model. This allows us to monitor a complex environment with multiple chickens and eggs moving and appearing simultaneously within the video frames. The models can label video frames with classifications for 8 breeds of chickens and/or 4 colors of eggs, with 98% accuracy on chickens or eggs alone and 82.5% accuracy while detecting both types of objects. With the ability to directly inferred and store classifications on the camera, this setup works in a low/no internet bandwidth setting. Having these classifications, provides the necessary base data required for accurately measuring the individual egg production of every chicken in the flock and supports additional flock production analysis",
    "Category": "DL"
  },
  {
    "Title": "Defect detection in eggshell using a vision system to ensure the incubation in poultry production",
    "Abstract": "This paper describes a method for detecting defects on curved surfaces. In particular, this research focuses on defects in poultry eggs for damage identification in the shell as a result of thin-shelled eggs. The vision system is based on defect detection by scanning a laser pattern of structured light and imaging, highlighting the changes in geometry as a result of deformation of the laser transitions generated by scanning the egg surface. Then, the images are analyzed to obtain equidistant points along the curve and evaluated by creating a cubic spline interpolation. The interpolation allows for the extraction of descriptive metric characteristics to observe the disparity between curves, illustrating the defects by performing graph interposition. The obtained metric information is used to classify the defective samples by developing an algorithm using an artificial neural network, trained with a database composed of 200 images, wich achievies 97.5% efficiency during the evaluation of 150 egg samples. This technique can be applied to detecting corrugated, wrinkled, pimpled, odd- shaped and misshapen eggs.",
    "Category": "DL"
  },
  {
    "Title": "Eggshell deformation detection applying computer vision",
    "Abstract": "This work describes a method for detecting deformations on curved surfaces, focusing especially on the study of deformations in poultry eggs to identify shell damages caused by thin-shelled eggs, or in coltsfoot. The proposed system is based on the detection of defects by sweeping a pattern of laser structured light and imaging, highlighting the changes in geometry as a result of the laser transitions deformation generated by scanning the surface of egg; then the images are analyzed to obtain equidistant points along the curve and evaluated by generating a cubic spline interpolation that allows the extraction of descriptive metric characteristics to observe the disparity between curves showing deformation by performing a graph interposition, the metric information acquired is used to classify the defective samples developing an artificial neural network, achieving a 97.5% efficiency during evaluation.",
    "Category": "DL"
  }
]